{
    "Title": "5 Tips on Dealing with College Stress",
    "Slug": "5-tips-on-dealing-with-college-stress",
    "Collection ID": "6414e6adc3b6490969cdbc53",
    "Item ID": "641b82c440b41ff53cbdda1e",
    "Created On": "Wed Mar 22 2023 22:35:48 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sun Jul 30 2023 22:06:21 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Jul 30 2023 23:07:44 GMT+0000 (Coordinated Universal Time)",
    "Title Tag": "5 Tips on Dealing with College Stress",
    "Author(s)": "Maria Cardenas",
    "Date Published": "Tue Jul 19 2022 00:00:00 GMT+0000 (Coordinated Universal Time)",
    "Blog Intro": "Dealing with college stress can be overwhelming, especially since it comes with a new step in your life. College opens up new adventure and possibilities, but many health risks surround these activities. From illnesses to unhealthy lifestyle habits, these are real concerns college students may face without thinking about it. That is to say, focusing a bit of your attention on your physical and mental health can prevent issues in the long run, and help you better manage the demanding life of college!",
    "Blog Content": "<p id=\"\">Dealing with college stress can be overwhelming, especially since it comes with a new step in your life. College opens up new adventure and possibilities, but many health risks surround these activities. From illnesses to unhealthy lifestyle habits, these are real concerns college students may face without thinking about it. That is to say, focusing a bit of your attention on your physical and mental health can prevent issues in the long run, and help you better manage the demanding life of college! &nbsp; </p><p id=\"\"> </p><p id=\"\">1. Stay Active &nbsp; </p><p id=\"\">Our bodies were made to move often. Sitting in class all day and then binging your favorite show at night means your body likely isn’t getting enough activity. This can lead you to feel bad both physically and emotionally, which can cause stress. &nbsp; </p><p id=\"\">To help prevent the ill effects of inactivity, find creative ways to squeeze in more movement before and after classes as well as during breaks. &nbsp; </p><p id=\"\"> </p><p id=\"\">2. Take an Exercise Class &nbsp; </p><p id=\"\">There is a ton of research that connects regular exercise with stress reduction. According to <a href=\"https://physoc.onlinelibrary.wiley.com/doi/full/10.1113/JP271552\" target=\"_blank\" id=\"\">The Journal of Physiology</a>, exercise has been found to increase neurogenesis (the creation of new brain cells) in the hippocampus, the area of the brain that controls learning and memory. Yes, your daily twenty-minute jog might help you retain what you’re learning in class! &nbsp; </p><p id=\"\"> &nbsp; </p><p id=\"\">3. Maintain a Healthy Diet &nbsp; </p><p id=\"\">You need to put your best system forward when the flu virus starts going around. This means you should pay attention to not just your hygiene, but also your diet! According to <a href=\"https://www.scientificamerican.com/article/does-sugar-really-suppress-the-immune-system/\" target=\"_blank\" id=\"\">Scientific American</a>, consuming too much sugar can negatively affect immune system cells that attack bacteria, which means your body won’t be ready for a fight against germs if you keep downing sodas or sugary coffee drinks. &nbsp; </p><p id=\"\">Eating nutrient-dense foods not only prevents illness, but can also help you feel better all around. Think about it: How productive did you feel after a late-night study session with pizza, cookies, and soda? Maybe a little stressed? Focusing your diet on lean protein, healthy carbs, vegetables, and fruit can help you better balance your hectic schedule. &nbsp; </p><p id=\"\"> &nbsp; </p><p id=\"\">4. Practice Mindfulness &nbsp; </p><p id=\"\">Taking care of your mental health is just as important as taking care of your physical health, especially during stressful parts of the semester like midterms and finals. <a href=\"https://www.apu.edu/articles/reclaiming-mindfulness/\" target=\"_blank\" id=\"\">Mindfulness exercises</a>, such as writing down daily affirmations, practicing gratitude, and intentionally slowing down, can help you feel better inside and out. &nbsp; </p><p id=\"\">“Deep breathing can be a helpful relaxation exercise,” said Hoy. “It increases oxygen to one’s muscles, releases endorphins, and has a relaxing effect on the body.” &nbsp; </p><p id=\"\">When you’re feeling stressed or overwhelmed, take a moment to pause and reflect. Ask yourself why you’re feeling this way. Are you adding more responsibilities to your list than you need to, or are you stressing about something you can’t control? &nbsp; </p><p id=\"\">A great approach to managing stress in college is taking a few moments to check your mindset and then reflect on the truth of the situation. This brief exercise can help you remember what you are responsible for in the moment—and see a clearer path forward. &nbsp; </p><p id=\"\"> &nbsp; </p><p id=\"\">5. Seek Help for Stress and Anxiety &nbsp; </p><p id=\"\">If you find that you’re experiencing a lot of stress and anxiety during your time on campus, it’s a good idea to <a href=\"https://www.apu.edu/articles/mental-health-resources-for-college-students/\" target=\"_blank\" id=\"\">reach out for some help</a>! Talking through issues can help them seem more manageable, and it’s always nice to know someone is in your corner. &nbsp; </p><p>‍</p>",
    "Blog Image": "https://uploads-ssl.webflow.com/61a33234ec52cc692c647c76/62d9c03a81642348ca896abb_5%20Tips.png",
    "Author Bio": "Maria is a tutor and a volunteer at the Thaddeus Resource Center in Agape House and other departments. Her Bachelor's degree is in Education in Kindergarten and Preschool. She is studying for a Master of Arts in Teaching English as Second Language (TESOL) at the Westcliff University in Irvine, California. She aspires to be an English Teacher serving children, teenagers, and adults. In her free time, she likes to cook, eat, read, and spend time with her loved ones.",
    "Link for Author info": "https://www.thaddeus.org/staff"
}