{
    "Title": "Active Listening",
    "Slug": "active-listening",
    "Collection ID": "6414e6adc3b6490969cdbc53",
    "Item ID": "642b20743b450b28302cc1c0",
    "Created On": "Mon Apr 03 2023 18:52:36 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sun Jul 30 2023 22:05:06 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Jul 30 2023 23:07:44 GMT+0000 (Coordinated Universal Time)",
    "Title Tag": "Active Listening",
    "Author(s)": "Annick Bangou",
    "Date Published": "Fri Nov 19 2021 00:00:00 GMT+0000 (Coordinated Universal Time)",
    "Blog Intro": "While reading a book or having a discussion with an individual, you can go back and reread or ask a question to clarify a point. This is not always true when listening. Listening is of the moment, and we often only get to hear the speaker’s words once. The key then is for the listener to ascertain the speaker’s central premise or controlling idea quickly.",
    "Blog Content": "<p id=\"\"><em id=\"\">While reading a book or having a discussion with an individual, you can go back and reread or ask a question to clarify a point. This is not always true when listening. Listening is of the moment, and we often only get to hear the speaker’s words once. The key then is for the listener to ascertain the speaker’s central premise or controlling idea quickly.</em>    <br><br>Active Listening is the process of listening attentively while someone else speaks this pattern of listening often includes paraphrasing, reflecting back, and withholding judgement and advice.   <br>This can be remembered by the 3 A's of active listening   <br><strong id=\"\">– Attention</strong>  <br><strong id=\"\">– Attitude</strong>  <br><strong id=\"\">– Adjustment</strong>    <br><br>‍<strong id=\"\">Attention – </strong>Active listening is a state of mind that requires us to choose to focus on the moment, being present and attentive while disregarding any of our anxieties of the day. Some of the main areas to pay attention to are distinguishing the speaker’s primary goal, the main points, and the structure of the communication. Attention also shows the speaker that we are engaged rather than zoned out. <strong id=\"\">Example – </strong>write \"listen\" at the top of your notes as a reminder or use body language to show you are engaged    <br><br>‍<strong id=\"\">Attitude - </strong>Attitude is just as important as the attention given to the speaker. Telling yourself the lecture is a waste of time is not going to help you to listen effectively. Approaching a listening task with a positive attitude to prevent making snap judgements that justify inattentiveness.   <br>‍<strong id=\"\">Example – </strong>decide where you stand on a topic after listening, be ready and willing to be patient and see where to speaker is leading you, refrain from speaking until after you gauge the overall idea     <br><br>‍<strong id=\"\">Adjustment - </strong>Adjustment means that the listener is willing to change, adapt, and adjust mannerisms in order to follow the speaker’s train of thought until the conclusion. The speaker relies on the audience to provide visual cues to know that the audience is listening and that there is a shared understanding of what is being presented. It is the listeners role to provide these cues in order to show active listening feedback.  <br>‍<strong id=\"\">Example - </strong> react to the cues the speaker gives by showing expressions, adjust your focus on the speaker through an upright position and eye contact     <br><br>The process of actively listening assists people with strengthening intimate relationships, you are showing them that they are important and worthy of attention. This goes a long way toward sustaining a positive relationship, yet there are many barriers deter us from actively listening, these include:     <br> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<strong id=\"\">Anticipating-</strong> formulating what you want to say before the speaker finishes their statement, you shouldn't assume the speakers conclusion halfway through their statement and configure your own response. <em id=\"\">Instead, refrain from speaking until the speaker has finished and instead focus on what the speaker is trying to claim</em>  <br> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<strong id=\"\">Judging- </strong>Once a judgement has been made, listening is lessened, you may stop listening actively because the speaker lost credibility by making a mistake, you are making a choice to stop listening and rate the speaker poorly.  <em id=\"\">Instead, accept the fact that people make mistakes and that doesn't make them incompetent, give them a chance to repair their credibility </em>  <br> &nbsp; &nbsp; &nbsp; &nbsp; <strong id=\"\"> Emotional Reactions- </strong>Sometimes, triggers may act as a listening barrier and overbear emotions which could end an argument due to an inability to have thoughtful communication. <em id=\"\">Instead, acknowledge your emotional triggers and set them aside to hear out the speaker, take into account everyone has triggers and don’t let them transfer into judgement </em>    <br><br>When active listening, there are many techniques you can utilize that show the speaker that you are attentive and giving your attention, a few examples are to: establish rapport, demonstrate concern, paraphrase, maintain eye contact, nod/ lean in forward, and give brief affirmations such as \"I understand\" or \"I know.\"  <br></p><p id=\"\"><em id=\"\"><br></em><strong id=\"\"><em id=\"\">References:</em></strong><em id=\"\"><br>Learning, L. (n.d.). Public speaking. Lumen. </em><a href=\"https://courses.lumenlearning.com/wm-publicspeaking/chapter/come-prepared/\" target=\"_blank\" id=\"\"><em id=\"\">https://courses.lumenlearning.com/wm-publicspeaking/chapter/come-prepared/</em></a><em id=\"\">. &nbsp; <br><br>the Mind Tools Content Team By the Mind Tools Content Team, Team, the M. T. C., wrote, B. T., &amp; wrote, L. (n.d.). Active listening: Hear what people are really saying. Communication Skills Training from MindTools.com. </em><a href=\"https://www.mindtools.com/CommSkll/ActiveListening.htm\" target=\"_blank\" id=\"\"><em id=\"\">https://www.mindtools.com/CommSkll/ActiveListening.htm</em></a><em id=\"\">. &nbsp; <br><br>Active listening: The art of empathetic conversation. PositivePsychology.com. (2021, April 12). </em><a href=\"https://positivepsychology.com/active-listening/\" target=\"_blank\" id=\"\"><em id=\"\">https://positivepsychology.com/active-listening/</em></a><em id=\"\">. &nbsp;<br>‍</em></p><p id=\"\">‍</p>",
    "Blog Image": "https://uploads-ssl.webflow.com/61a33234ec52cc692c647c76/642b20743b450bebd62cc1bb_61a56377c18cfc2dc63680ce_GetImage-5.png",
    "Author Bio": "My name is Annick Bangou, I am a virtual psychology intern in the Resource Center from San Bernardino, California. I am going into my senior year of college at the University of Redlands with a major in Health and Medicine and a minor in Psychology. Next year I plan to graduate from the University and enter a graduate school to attain my Doctorate of Physician Assistant.",
    "Link for Author info": "https://www.thaddeus.org/staff"
}