{
    "Title": "Homework Strategies",
    "Slug": "homework-strategies",
    "Collection ID": "6414e6adc3b6490969cdbc53",
    "Item ID": "641b7e44834f15374c43ae49",
    "Created On": "Wed Mar 22 2023 22:16:36 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sun Jul 30 2023 22:07:17 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Jul 30 2023 23:07:44 GMT+0000 (Coordinated Universal Time)",
    "Title Tag": "Homework Strategies",
    "Author(s)": "Meriam Khan",
    "Date Published": "Wed Nov 16 2022 00:00:00 GMT+0000 (Coordinated Universal Time)",
    "Blog Intro": "Do you have a difficult time studying or lack of motivation to get your work done? No problem! Here are a few tips that will hopefully help you get focused and improve your grades. To avoid lack of motivation, it would be a good idea to schedule a regular study time.",
    "Blog Content": "<p id=\"\">Do you have a difficult time studying or lack of motivation to get your work done? No problem! Here are a few tips that will hopefully help you get focused and improve your grades. </p><p id=\"\"> </p><p id=\"\">To avoid lack of motivation, it would be a good idea to schedule a regular study time. Try to set a time after school so you can get your work done and enjoy the rest of your day without having to worry about homework once you get home. Make sure you pay attention and take detailed notes during your class. This will help you understand your assignments better. </p><p id=\"\"> </p><p id=\"\">Plan ahead. Planners are my number one recommendation to staying organized and keeping track of your assignments. Prioritize how you will begin your assignments. For example, many students will begin their assignments by their upcoming due date to get those completed on time. Other ways to prioritize would be to begin by the assignments’ difficulty level. For example, easiest to hardest or hardest to easiest. Color coding is also a great way to stay organized and to distinguish your assignments per class. </p><p id=\"\"> </p><p id=\"\">Another tip would be to limit your distractions. If you think you will focus better by studying in a quiet space by yourself, do that. If you study better as a group, go to the library or somewhere relaxing where you can individually do your own work or work together. If your phone is a distraction, try turning it off, or set a timer with how long you plan to study or when to take a break. An important thing to keep in mind is taking care of your mental health! Do not stress yourself out by overstudying or trying to cram last minute for an exam. Make sure you plan out a schedule where you have enough time to do so. Hydrate and eat some snacks to maintain a healthy nutrition. Some students reward themselves as a motivation for their hard work. These “rewards” can vary from taking a break, to eating some sweets, etc. </p><p id=\"\"> &nbsp;</p><p id=\"\">If you need help or are struggling, reach out to your teachers, they are there to help. You can also ask your peers or get tutoring for additional support. Tutoring is usually offered at schools, after school programs, or at other non-profit organizations for free. Thaddeus offers free virtual tutoring for students K-12. If you would like to learn more and utilize these services, feel free to visit our website for more information! </p><p>‍</p>",
    "Blog Image": "https://uploads-ssl.webflow.com/61a33234ec52cc692c647c76/637559272f6a3d44338e3c6f_AdobeStock_104936569-webuse.jpeg",
    "Author Bio": "Meriam is a Social Work Intern at Thaddeus. She graduated from CSUDH with a B.A. in Sociology with a double minor in Chicana/o Studies and Psychology. On her free time, she enjoys baking, photography, and spending time with her family and friends. She is passionate about helping others and plans to attend graduate school in the future for her MSW.",
    "Link for Author info": "https://www.thaddeus.org/staff"
}