{
    "Title": "Impact of Electronic Gadget on students' Performance",
    "Slug": "impact-of-electronic-gadget-on-students-performance",
    "Collection ID": "6414e6adc3b6490969cdbc53",
    "Item ID": "641b741cba8e6f9594e04a99",
    "Created On": "Wed Mar 22 2023 21:33:16 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Fri May 12 2023 06:10:17 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Fri May 12 2023 19:25:36 GMT+0000 (Coordinated Universal Time)",
    "Title Tag": "Impact of Electronic Gadget on students' Performance",
    "Author(s)": "Janet Li",
    "Date Published": "Thu Jan 26 2023 00:00:00 GMT+0000 (Coordinated Universal Time)",
    "Blog Intro": "Under the influence of the pandemic of coronavirus, electronic devices have become more indispensable in students’ life and learning processes. Electronic devices can help students obtain educational resources more conveniently and improve efficiency and performance. However, entertainment is also easier to access on electronic devices. Excessive entertainment will result in a decrease inefficiency and time used on studying. If a student wants to be successful, he/she needs to pay more attention to self-management using electronic devices.",
    "Blog Content": "<p id=\"\">‍</p><p id=\"\">Under the influence of the pandemic of coronavirus, electronic devices have become more indispensable in students’ life and learning processes. Electronic devices can help students obtain educational resources more conveniently and improve efficiency and performance. However, entertainment is also easier to access on electronic devices. Excessive entertainment will result in a decrease inefficiency and time used on studying. If a student wants to be successful, he/she needs to pay more attention to self-management using electronic devices.</p><p id=\"\">&nbsp;</p><p id=\"\">‍</p><p id=\"\">In order to see how the usage of technology affects students’ performances, a survey was conducted on 30 university students. As shown inFigure 1, students have smart devices for multiple purposes. Such are entertainment, studies, games, movies, online classes, and phone calls. The overall student spent an average of 7.4 hours on their electronic devices. The survey gave us information about the relationship between students’ GPAs and the time allocation of their smart devices.&nbsp;</p><p id=\"\">&nbsp;</p><p id=\"\">&nbsp;&nbsp;</p><p id=\"\">Among all the students, students with a 3.50 - 3.99 GPA do not use smart devices for gaming.. But more focus on educational purposes, which are studies and online classes.&nbsp;</p><p id=\"\">&nbsp;</p><p id=\"\">In addition, changes in the time allocation of smart devices may impact futureGPA. 0.37 percent of the student found an increase in GPA after eliminating gaming and movies from their smartphone uses. 0.27 percent of the student have a decrease in GPA and have a higher percentage of time allocated to gaming and movies than students with increasing GPA.&nbsp;</p><p id=\"\">&nbsp;</p><p id=\"\">This survey suggests students who use smart devices primarily for educational purposes result in better academic performance. It shows that students need to manage their time with electronic devices if they want to be successful in academics.</p><p id=\"\">&nbsp;</p><p id=\"\">Reference:</p><p id=\"\">FuTurisTic.“Impact of Electronic Gadget on Students Results.” <em id=\"\">Kaggle</em>, 15 Sept. 2022, www.kaggle.com/datasets/nabilajahan/the-impact-of-electronic-gadget-uses.&nbsp;</p><p>‍</p>",
    "Blog Image": "https://uploads-ssl.webflow.com/61a33234ec52cc692c647c76/63d1abdb09bec57420c04df9_7-Reasons-Why-Children-Learn-Faster-Through-Smart-Learning-Devices.png",
    "Author Bio": "Thank you for reading! I am Janet Li, I work as a Data Analysis at Thaddeus and am currently a student at the University of California, Davis. Here is Thaddeus I am able to develop my skill in Data Analysis and contribute to a non-profit organization.",
    "Link for Author info": "http://www.thaddeus.org/staff#Janet"
}