{
    "Title": "Overcoming Learning Obstacles",
    "Slug": "overcoming-learning-obstacles",
    "Collection ID": "6414e6adc3b6490969cdbc53",
    "Item ID": "641b6c53cd045d52e6441b9f",
    "Created On": "Wed Mar 22 2023 21:00:03 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sun Jul 30 2023 22:08:10 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Jul 30 2023 23:07:44 GMT+0000 (Coordinated Universal Time)",
    "Title Tag": "Overcoming Learning Obstacles",
    "Author(s)": "Nancy A. Carlson",
    "Date Published": "Fri Jan 20 2023 00:00:00 GMT+0000 (Coordinated Universal Time)",
    "Blog Intro": "School does not always give us the tools we need to advocate for ourselves and motivate us to be the leader of our own academic destiny. This blog outlines 10 steps you can use to overcome your learning obstacles and help you to become the leader of your own academic success.",
    "Blog Content": "<p id=\"\">If the 2020-2022 COVID-19 pandemic taught us anything, it is that learning can be a challenging endeavor. During these difficult two years, our traditional learning environment was suddenly turned on its head, exposing many academic systems across the country for their lack of agility to adapt their in-person classrooms to an online learning environment. Suddenly, we all had to become experts at Zoom and other video conference call software. In many cases, teachers and academics had to redesign their curriculum and adjust their academic expectations for their students. &nbsp;Yet, as someone who has been both a teacher and student, I believe something even more significant was exposed throughout this ordeal; How do we overcome our own learning obstacles? Putting the very young children aside for just a minute, as emerging young adults, we expect a school to prepare us for entering the big world in front of us. Yet school does not always give us the tools we need to advocate for ourselves and motivate us to be the leader of our own academic destiny. This blog outlines 10 steps you can use to overcome your learning obstacles and help you to become the leader of your own academic success. </p><p id=\"\"> &nbsp;</p><p id=\"\">1. Motivation: Learning can be exciting, rewarding, and fulfilling when the subject truly interests us. However, sometimes learning a skill or subject is imposed on us because it meets some academic requirements. In those cases, finding your own personal motivation to learn can be challenging. </p><p id=\"\">1.1 Identify your goals: Break down your learning process into an achievable specific goal you hope to meet by learning this subject. &nbsp;</p><p id=\"\">1.2 Find a reason that matters to you: If you are struggling to find a personal connection to the subject you are learning, try to think about how it relates to your values or long-term aspirations. This can help give you a sense of purpose and make learning feel more meaningful. &nbsp;</p><p id=\"\">1.3 Make a plan: Break your learning goals into smaller, more manageable chunks, and create a plan for how you will tackle each one. This can help you feel more in control of your learning process and give you a sense of accomplishment as you progress. &nbsp;</p><p id=\"\">1.4 Reward yourself: Learning is hard work! Eating well, resting, and giving yourself time to recharge your batteries are all important rewards to give yourself. When you reach a learning goal, stop, and celebrate your progress with some small reward. This can be a favorite snack or spending time with a friend. Rewards help you avoid burnout and stay focused. </p><p id=\"\"> &nbsp;</p><p id=\"\">2. Limits: Identifying your limitations when starting any learning process can be critical when setting goals and taking steps to overcome them. Personally, I was unaware I had dyslexic until I entered college. Once I was tested, I was given the proper accommodation to learn and my grades changed overnight. </p><p id=\"\">2.1 Lack of time: Many students have busy schedules and finding enough time to devote to learning can be a challenge. Ask family and friends to support your academic goals, by giving you the time and space you need for your studies. Prioritize your subjects by the most and least time-consuming and set time limits so you can move to the next subject when that time has expired. </p><p id=\"\">2.2 Difficulty understanding the material: Struggling to understand a subject can be very frustrating and lead to a lack of motivation to continue. Research the topic you are about to study and find resources that have a track record of teaching or tutoring on this subject. There are many great online free resources such as Khan Academy for math, <a href=\"https://www.khanacademy.org/\" target=\"_blank\" id=\"\">https://www.khanacademy.org/</a> </p><p id=\"\">2.3 Distractions: It can be difficult to focus on learning when there are competing demands for your attention such as social media, or surrounding noises. Find a place that is quiet and private for your study time. Maybe this is a library, or at a friend’s house where you study together. Using noise-canceling headphones can also be a handy tool. </p><p id=\"\">2.4 Learning differences: Learning a different way because of a disability such as dyslexia or ADHD can be extremely challenging. If you find yourself constantly struggling in a similar way over time, getting testing can be a game changer. There are many public resources set aside to test and help students who require accommodations in the classroom and during tests. &nbsp;</p><p id=\"\"> &nbsp;</p><p id=\"\">3. Access: Learning a new subject is hard enough without adding to it a lack of access to quality educational materials such as books, libraries, computers, and internet connections. &nbsp;</p><p id=\"\">3.1 Access to resources: Many schools and libraries have computers that students can use and many offer free internet access. &nbsp;</p><p id=\"\">3.2 Nonprofit organizations: There are many nonprofit organizations that provide access to technology for students in need. One is the International Association of Computer Science and Information Technology (IACSIT). They provide computers and internet access to students in developing countries. <a href=\"http://www.iacsit.org/\" target=\"_blank\" id=\"\">http://www.iacsit.org/</a> </p><p id=\"\">3.3 Government programs: There are programs in place to help students access technology. The Federal Communications Commission (FCC) has a program called the E-Rate program that helps schools and libraries obtain affordable telecommunications and internet access. <a href=\"https://www.fcc.gov/consumers/guides/universal-service-program-schools-and-libraries-e-rate\" target=\"_blank\" id=\"\">https://www.fcc.gov/consumers/guides/universal-service-program-schools-and-libraries-e-rate</a> </p><p id=\"\">3.4 Charitable organizations: There are also many charitable organizations that provide computers and internet access to students in need. The Computers with Causes program provides refurbished computers to students, schools, and other organizations. <a href=\"https://www.computerswithcauses.org/application/\" target=\"_blank\" id=\"\">https://www.computerswithcauses.org/application/</a> </p><p id=\"\"> &nbsp;</p><p id=\"\">4. Fear: We all want to succeed at whatever we target our energy toward. Fear is a powerful force that can stop us in our tracks and stump any growth we attempt to make. However, handled in a loving way, fear can also be the energy we need to push past our most limiting thoughts. </p><p id=\"\">4.1 Identify the source of your fear: It can be helpful to identify the specific thing that you are afraid of, as this can help you better understand your fear and finds ways to address it. </p><p id=\"\">4.2 Talk to someone about your fear: Sharing your fear with a trusted friend, family member, or teacher can help you feel less alone and provide you with support and encouragement. </p><p id=\"\">4.3 Take small steps: When fear feels large and all-consuming it can help to break it down into smaller, more manageable pieces. By identifying the components of your fear, you can channel your energy to face one aspect of a fearful feeling and give you some sense of control over the situation. </p><p id=\"\">4.4 Practice relaxation techniques: Relaxation techniques such as deep breathing or meditation, can make a big difference in your ability to manage your fear and feel calmer and focused. &nbsp;</p><p id=\"\"> &nbsp;</p><p id=\"\">5. Procrastination: Ah, procrastination! This evil goal sucker has at one time or another entered most of our lives. Delaying the start or completing a task can lead to feeling overwhelmed and having low self-esteem. Procrastination is especially challenging for those of us who take on too much and find it difficult to manage our time effectively. </p><p id=\"\">5.1 Plan your work and work your plan: Plan how you will complete your work. This includes when you will work on each task and how long you will work on it. Set a timer for a specific amount of time and commit to working on a task until the timer goes off. </p><p id=\"\">5.2 Set specific goals: Setting specific, achievable goals can help you focus your efforts and make progress. &nbsp;</p><p id=\"\">5.3 Remove distractions: The easiest of these is your phone. Turn it off while you work on a challenging task. Most phones have a “Do not disturb” feature you can turn on when needed. Find a quiet place to work. </p><p id=\"\">5.4 Seek accountability: Ask a friend or family member to help you stay on track, someone who is supportive and motivates you to complete your work. </p><p id=\"\">5.5 Take breaks: It is important to take breaks when you are learning, as this can help you stay fresh and focused. Exercise is a great way to spend your break time since it feeds both your body and your brain. Just be sure to return to your work when your break is over. </p><p id=\"\"> &nbsp;</p><p id=\"\">6. Disabilities: Depending on the specific nature of a disability, be it physical or mental, a disability can impede the learning process in a variety of ways. To help students overcome such challenges I suggest these following strategies: </p><p id=\"\">6.1 Seek accommodations: Many schools and universities have resources in place to help students with disabilities succeed academically. These may include things like extra time on tests, access to assistive technology, or the use of a notetaker. </p><p id=\"\">6.2 Use assistive technology: There are many types of assistive technology available that can help students with disabilities overcome barriers to learning. These may include screen readers for students who are blind, voice recognition software for students with physical disabilities, or text-to-speech software for students who have difficulty reading. </p><p id=\"\">6.3 Find a support network: Connecting with other students who have similar disabilities can be a great way to find support and get ideas for overcoming similar challenges. </p><p id=\"\"> &nbsp;</p><p id=\"\">7. Ask for help: It is important to remember that everyone needs help at some point in their lives, and it is ok to ask for it. Asking for help shows that you are committed to learning and are willing to put in the effort to succeed. Guess what? Teachers live to find committed learners in their classes. By asking for help, you just made their day. </p><p id=\"\">7.1 Identify when you need help: Pay attention to when you are feeling stuck or confused while learning, as these may be times when you could benefit from additional help. &nbsp;</p><p id=\"\">7.2 Ask for help early: Don’t wait until you are completely stuck to ask for help. The sooner you get the help you need, the easier it will be to get back on track. </p><p id=\"\">7.3 Be specific about your needs: By being specific about what you are struggling with, will make it easier for the person you are asking to understand your needs and provide the right kind of assistance. &nbsp;</p><p id=\"\">7.4 Know whom to ask: Make a list of people whom you can turn to for help, such as teachers, tutors, counselors, classmates, or family members. Many schools also have learning centers that can direct you to additional resources. And don't forget about free help online. Two of my favorite resources are: MIT Open Courseware, <a href=\"https://ocw.mit.edu/\" target=\"_blank\" id=\"\">https://ocw.mit.edu/</a> and Professor Leonard for pre-algebra to calculus 3, <a href=\"https://www.youtube.com/channel/UCoHhuummRZaIVX7bD4t2czg\" target=\"_blank\" id=\"\">https://www.youtube.com/channel/UCoHhuummRZaIVX7bD4t2czg</a> Both of these resources made my educational trajectory possible. </p><p id=\"\">7.5 Scholarships: There are many scholarships that offer financial help to those who show need and academic enthusiasm. As an example, the 2022-2023 Cutler-Bell Prize looks to recognize up to four high school senior students residing in the U.S. for their projects in CS. Winners will receive a $10,000 prize to go to their college/university of choice. Applications are due by Jan. 27, 2023. <a href=\"https://csteachers.org/cutler-bell\" target=\"_blank\" id=\"\">https://csteachers.org/cutler-bell</a> &nbsp;</p><p id=\"\"> &nbsp;</p><p id=\"\">8. Get involved: Making social connections outside of our academic classes is a great way to build a supportive circle of friends. &nbsp;</p><p id=\"\">8.1 Join a club or organization: Many schools have clubs and organizations that focus on a variety of interests, such as sports, music, art, or community service. </p><p id=\"\">8.2 Get involved in extracurricular activities: Many schools offer extracurricular activities, such as sports teams or performing arts groups, that can be a great way to get involved and build new skills. &nbsp;</p><p id=\"\">8.3 Volunteer: Volunteering in your school or community can be a rewarding way to get involved and make a difference. &nbsp;</p><p id=\"\">8.4 Participate in leadership activities: Many schools have leadership programs or opportunities for students to take on leadership roles, such as serving as a class officer or representing your school at a conference. </p><p id=\"\"> &nbsp;</p><p id=\"\">9. Research: Doing research can be a helpful way for students who suffer from learning obstacles to learn new information and build their skills. As a result, students become more confident in their ability to learn and succeed. </p><p id=\"\">9.1 Build critical thinking skills: Research involves identifying a question or problem, gathering and evaluating evidence, and coming to a conclusion. These are all important critical thinking skills that can help students become more effective learners. &nbsp;</p><p id=\"\">9.2 Exposure to resources and perspectives: Doing research can expose students to a wide range of resources and perspectives on a given topic. This can lead them to a better understanding of the material and see things from a new viewpoint. &nbsp;</p><p id=\"\">9.3 Learning at your own pace: Rather than feeling rushed to keep up with a class or instructor, research can help students who need more time to process and understand new information. &nbsp;</p><p id=\"\">9.4 Feel more engaged and motivated: Research can be an engaging and rewarding activity. The process sets students up for a unique sense of accomplishment that comes from completing a research project. &nbsp;</p><p id=\"\"> &nbsp;</p><p id=\"\">10. Relationships: Building relationships with others can provide students with opportunities to collaborate and work together, which can be a very effective way to learn and solve problems. </p><p id=\"\">10.1 Support and encouragement: Building a supportive network of people who believe in you and encourage you can be a great source of motivation and help you persevere through challenging times. </p><p id=\"\">10.2 Sense of belonging: Belonging to a larger community is especially important for students who may feel isolated or marginalized due to their learning obstacles. &nbsp;</p><p id=\"\">10.3 Exposure to additional resources: Building relationships with teachers, tutors, and other students can provide students with access to additional resources and support that can help them learn more effectively. &nbsp;</p><p id=\"\">10.4 Role models: Relationships with successful students or educators can provide a student with role models who will inspire and guide them as they navigate their unique learning process. &nbsp;</p><p id=\"\"> &nbsp;</p><p id=\"\">In summary: </p><p id=\"\">Overcoming learning obstacles and succeeding academically is no small feat for students who face unique challenges in their life. To overcome a learning obstacle, it is important to first identify what the obstacle is and then develop a plan to address it. Personally, as someone who manages dyslexia, my process to assimilate new information is much slower than most students. I prepare ahead of the class by reading and writing about the subject which helps me process live lectures better. I find it helps to set specific achievable goals so I can focus my efforts and make incremental steps toward my goal. This may involve seeking help, using assistive technology, or finding other ways to work around your obstacle. Seeking out and building a supportive network around you is also tremendously beneficial. People such as teachers, tutors, and counselors have built their careers around helping students. Sometimes it is as simple as asking for help to set you on the best path forward. &nbsp;</p><p id=\"\"> &nbsp;</p><p id=\"\">What obstacles have you struggled with and what strategies have you put in place to best manage your obstacle? </p><p id=\"\">‍</p><p id=\"\">References: </p><p id=\"\">Rice, Gabe. \"The Most Common Barriers to Learning - And How to Overcome Them.\" <em id=\"\">thinkific.com, Thinkific Blog</em>, July 16, 2021, <a href=\"https://www.thinkific.com/blog/barriers-to-learning/\" target=\"_blank\" id=\"\">https://www.thinkific.com/blog/barriers-to-learning/</a> </p><p id=\"\">Site writer Et,al. \"What are the Most Common Barriers to Learning in School.\" <em id=\"\">successatschool.org, Success at School Blog</em>, 2023 <a href=\"https://successatschool.org/blog/507/What-are-the-Most-Common-Barriers-to-Learning-in-School%3F\" target=\"_blank\" id=\"\">https://successatschool.org/blog/507/What-are-the-Most-Common-Barriers-to-Learning-in-School%3F</a> </p><p id=\"\">Image credit: https://www.emergingedtech.com/2016/12/5-simple-techniques-to-help-your-students-learn-more-effectively/</p><p id=\"\">‍</p><p>‍</p>",
    "Blog Image": "https://uploads-ssl.webflow.com/61a33234ec52cc692c647c76/63cb07ebecda5737fdbcddec_Learning2.jpg",
    "Author Bio": "Nancy Carlson is a data science intern at Thaddeus Resource Center. Currently, she is finishing her second bachelor's degree in data science at the University of California at Irvine. She holds a bachelor's degree in fine arts from Otis Art Institute, and has been a textiles professor at the Fashion Institute of Design and Merchandising for over 15 years. Additionally, she has owned and operated a small retail business for 25 years. Her academic focus now is working with Natural Language Processing (NLP) and how language is used to influence perception. Nancy daily confronts her learning obstacle - dyslexia.",
    "Link for Author info": "https://www.thaddeus.org/staff"
}