{
    "Title": "Quick and Easy Student Friendly Recipes",
    "Slug": "quick-and-easy-student-friendly-recipes",
    "Collection ID": "6414e6adc3b6490969cdbc53",
    "Item ID": "641b83ec9e99a7cca1b0cb13",
    "Created On": "Wed Mar 22 2023 22:40:44 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sun Jul 30 2023 22:06:05 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Jul 30 2023 23:07:44 GMT+0000 (Coordinated Universal Time)",
    "Title Tag": "Quick and Easy Student Friendly Recipes",
    "Author(s)": "Angela Yang",
    "Date Published": "Mon Jan 10 2022 00:00:00 GMT+0000 (Coordinated Universal Time)",
    "Blog Intro": "Student life is quite the balancing act — finishing assignments, studying for exams, participating in clubs, working and interning, socializing. In all the chaos, the most fundamental, important things can sometimes fall through the cracks.",
    "Blog Content": "<p id=\"\"><strong id=\"\">Quick and Easy Student Friendly Recipes </strong> </p><p id=\"\">Student life is quite the balancing act — finishing assignments, studying for exams, participating in clubs, working and interning, socializing. In all the chaos, the most fundamental, important things can sometimes fall through the cracks. Things like sleeping enough, exercising regularly, e<em id=\"\">ating well</em>. Last week, we talked about how our diets have a significant impact on our physical and mental health. This week, we’ll explore a few flexible, quick, and affordable recipes to help build a diet that supports our mind and body through our most hectic days. &nbsp;</p><p id=\"\"> </p><p id=\"\"><strong id=\"\">The More-Than-Salad</strong> </p><p id=\"\">Let’s be honest. Salads are one of those aspirational foods we picture for some far-off, more put-together version of ourselves. What’s more, they can be more expensive and less convenient to buy than items from a fast food joint. However, a few changes can overhaul our negative impressions. &nbsp;</p><ul id=\"\"><li id=\"\">Instead of premade salads, buy raw ingredients you enjoy, even if they don’t traditionally go in a salad. Think peppers, potatoes, eggs, beans, mushrooms, and a variety of fruits and nuts. Buying in bulk saves you money and trips to the store. </li><li id=\"\">Pick a vegetable base and 3 toppings that could go well together, making sure to include at least one protein and one carbohydrate. Get experimental — mixing in sweet and savory can result in great tastes, and you can find your favorite combinations to return to. </li><li id=\"\">Don’t be afraid to turn on the stove — a warm meal can truly be the saving grace at the end of a long day. Plus, cooked foods are more flavorful. Try grilling the peppers, giving those tomatoes a quick sauté, or searing fruit slices to bring out their sweetness. And don’t just stick to salt and pepper for seasoning — try sesame oil, paprika, chili powder, cumin. &nbsp;</li><li id=\"\">Assemble, enjoy, and rotate your ingredients so it never gets old! &nbsp;</li></ul><p id=\"\"> </p><p id=\"\"><strong id=\"\">Poke Bowl</strong> </p><p id=\"\">Originating from the Polynesian islands, poke began as a diced fish snack for fishermen. Over time, various communities such as Japanese emigrant farmers and modern day chefs have adapted (and perhaps appropriated) it into a flexible meal with a plethora of ingredient choices. Given a few key materials, you can make a version of the poke bowl that suits your diet and favorite tastes. </p><ul id=\"\"><li id=\"\">Rice. A staple of the poke bowl is white or brown rice. With a splash of white rice vinegar, salt, and sugar, you can turn it into flavorful sushi rice. &nbsp;</li><li id=\"\">Vegetables: Avocados, edamame, and seaweed are commonly found in poke bowls. You can also add vegetables of your own choosing, such as squash, asparagus, or cucumber. &nbsp;</li><li id=\"\">Protein: Although raw fish was once the primary ingredient, you can exchange it for tofu, egg, or any other diced meat to fit your budget and diet. &nbsp;</li><li id=\"\">Seasoning: You can make your own sauce by combining soy sauce, sesame oil, chili sauce, lime juice, and chopped green onion. &nbsp;</li></ul><p id=\"\"> </p><p id=\"\"><strong id=\"\">Pizza in a Pan</strong> </p><p id=\"\">Pizza is usually seen as a junk food, but it doesn’t have to be. All you need for this recipe is store-bought flatbread, tomato sauce or pesto, cheese, and any form of veggies or protein. &nbsp;</p><ul id=\"\"><li id=\"\">Begin by choosing 2-3 toppings to sauté. For example, you could combine diced mushrooms, spinach, and pepperoni. Or you could try sliced zucchini, pineapple, and corn. Or olives, onion, and tomato. Again, don’t be afraid to experiment with different combinations. Once sautéed, set the toppings to the side. </li><li id=\"\">Take your flatbread and spread tomato or pesto sauce over it. Sprinkle cheese if you choose, and set your sautéed items on top. &nbsp;</li><li id=\"\">Place the flatbread with toppings in a pan. Heat it until the bread it toasty and the cheese is melted. And there you go — a pizza in a pinch. &nbsp;</li></ul><p id=\"\"> </p><p id=\"\">Ultimately, these recipes are about lowering the barrier-to-entry for nutritious and tasty cooking. You don’t need fancy cookware, expensive ingredients, or masterful culinary skills to eat well. All you need, truly, are basic ingredients and a few tried and true strategies to shape them into a meal. Once you gain an intuition for what combinations taste best to you, you can start building your own signature dishes that turn cooking from a chore into a hobby. &nbsp;</p><p>‍</p>",
    "Blog Image": "https://uploads-ssl.webflow.com/61a33234ec52cc692c647c76/61dc7eec36ccc2a06bcdbb61_food.jpg",
    "Author Bio": "Angela is a psychology intern at the Thaddeus Resource Center Agape House. She studies Psychology and Asian American Studies at Stanford and hopes to one day serve the mental health needs and education of immigrant families. In her free time, she enjoys creative writing.",
    "Link for Author info": "https://www.thaddeus.org/staff"
}