{
    "Title": "5 Tips for Juggling School and a Job",
    "Slug": "5-tips-for-juggling-school-and-a-job",
    "Collection ID": "6414e6adc3b6490969cdbc53",
    "Item ID": "641b8339bcb383d44ee2dcf1",
    "Created On": "Wed Mar 22 2023 22:37:45 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sun Jul 30 2023 22:06:13 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Jul 30 2023 23:07:44 GMT+0000 (Coordinated Universal Time)",
    "Title Tag": "5 Tips for Juggling School and a Job",
    "Author(s)": "Kathy Nguyen",
    "Date Published": "Tue Mar 22 2022 00:00:00 GMT+0000 (Coordinated Universal Time)",
    "Blog Intro": "Going to school and working can be quite difficult. In order to make sure you meet your deadlines it is helpful to write out your due dates on a google calendar. In doing so, you can see your due dates in advance and get your assignments, papers, and studying done before your work shifts.",
    "Blog Content": "<p id=\"\"><strong id=\"\">1.</strong> <strong id=\"\">Time management.</strong> </p><p id=\"\">Going to school and working can be quite difficult. In order to make sure you meet your deadlines it is helpful to write out your due dates on a google calendar. In doing so, you can see your due dates in advance and get your assignments, papers, and studying done before your work shifts. Time management is quite important because you have to balance your school responsibilities and work responsibilities such as saying no to plans when necessary and prioritizing your workload. &nbsp;</p><p id=\"\"> <br> </p><p id=\"\"><strong id=\"\"> 2. Saving time for a self-care day.</strong> </p><p id=\"\">Going to school full-time and having a job can be quite stressful. Often times we start feeling overwhelmed with the amount of work we have to get done. A lot of the time we get so caught up in our work we forget to save some time for ourselves. If we continue to work constantly, it will lead us to feel burnt out. A self-care day can include watching a show you have been wanting to watch, hanging out with friends, going for a hike, etc. A self-care day is needed to benefit you and your health. &nbsp;</p><p id=\"\"> <br> </p><p id=\"\"><strong id=\"\"> 3. Prioritize Health.</strong> </p><p id=\"\">Having a busy schedule with coursework and a job can be a lot for a student. Prioritizing health should be a priority such as getting an adequate amount of sleep, exercising, and eating a healthy balanced diet. Staying healthy will help you be productive and you will be able to get your schoolwork done. Being a student and working oftentimes we will get very stressed and that can be detrimental to your health. To prioritize your health, you can put aside time to meditate, go for a walk, and exercise to decrease stress levels. &nbsp;</p><p id=\"\"> <br> </p><p id=\"\"><strong id=\"\"> 4. Find a Study Space.</strong> </p><p id=\"\">It is important to find a place where you can do your homework, study, or work from. Now that a lot of jobs and schools are virtual it is important to be able to work somewhere that is quiet. It can be a desk at home, a study room at the library, or any place you work best in. This study place can be a place where you tell yourself “Okay for the next sixty minutes, I will focus on studying and nothing else.” Having this study space will help you focus on your work and get it done on time. </p><p id=\"\"> <br> </p><p id=\"\"><strong id=\"\"> 5. Communicate with Teachers and Bosses</strong> </p><p id=\"\">As a student, it is important to communicate to professors and bosses the schedule changes you may have. If a professor understands how busy you are with work, they will be more willing to accommodate your needs. It is important to communicate with your boss that school is your main priority. It is also helpful to tell your boss your school hours before you start your job just to make sure the schedules do not overlap. You can also ask for fewer hours at the beginning of your job and then work your way up for a more intensive schedule as you progress in school as well. In doing so, you can see how much you can handle and balance. &nbsp;</p><p>‍</p>",
    "Blog Image": "https://uploads-ssl.webflow.com/61a33234ec52cc692c647c76/623a1d231972eb8482e304d6_AdobeStock_135692151.jpg",
    "Author Bio": "Kathy Nguyen is a Psychology student at the University of California, Riverside. While going to school, she is also a research assistant in the Leadership and Groups Dynamic Lab at the University of California, Riverside. She also takes the role as a Human Resource and Psych intern at Thaddeus Resource Center. After graduating college, she aspires to become an I/O Psychologist.",
    "Link for Author info": "https://www.thaddeus.org/staff"
}