{
    "Title": "Burnout 101: Prevention and How to Overcome It",
    "Slug": "burnout-101-prevention-and-how-to-overcome-it",
    "Collection ID": "6414e6adc3b6490969cdbc53",
    "Item ID": "644c129273bbeedd223ebe9d",
    "Created On": "Fri Apr 28 2023 18:38:10 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sun Jul 30 2023 22:04:49 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Jul 30 2023 23:07:44 GMT+0000 (Coordinated Universal Time)",
    "Title Tag": "Burnout 101: Prevention and How to Overcome It",
    "Author(s)": "Jodie Hung",
    "Date Published": "Wed Nov 03 2021 00:00:00 GMT+0000 (Coordinated Universal Time)",
    "Blog Intro": "The school year starts and work just keeps piling up. You feel like you don’t have anything left in you and can’t find motivation to do anything anymore. Chances are, you’re experiencing burnout. Burnout is usually caused by taking on too much, a lack of social support and/or poor self-care.",
    "Blog Content": "<p id=\"\">The school year starts and work just keeps piling up. You feel like you don’t have anything left in you and can’t find motivation to do anything anymore. Chances are, you’re experiencing burnout. Burnout is usually caused by taking on too much, a lack of social support and/or poor self-care. Luckily, you’re not alone ­– almost everyone has experienced burnout before and there are ways to get out of it and avoid burning out in the future. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; </p><p id=\"\">The first tip that may help you out of your rut is to prioritize. There are going to be certain things that you must let go or pass on to someone else, but you must be honest with yourself and pick the MOST important tasks to work through. Otherwise, you will end up drowning in responsibilities that you simply cannot handle. You should also prioritize self-care. One of the earliest signs of burnout for me is when I stop exercising, eating healthily, or reading before bed. So, if you find yourself falling behind on your self-care routine, take a day for yourself and make sure you aren’t sacrificing your well-being in the process. </p><p id=\"\">Another helpful tip is to work in short and productive chunks instead of allowing homework to drag on over time. It is much easier the muster up the motivation to work for 1 hour than a whole day. My favorite way of breaking up my work is by using the Pomodoro technique, which involves working for 25 minutes and then taking a 5-minute break. During these 25 minutes, you should be solely focusing on one task (again, prioritization is key) and during the break you can fully relax. By setting a firm deadline for work, it gives you something to look forward to, which also helps mitigate feelings of hopelessness that is commonly associated with burnout. </p><p id=\"\">To prevent burnout in the future, my psychology professor always encouraged us to dedicate one full day a week to ourselves. It is not a surprise that a lot of students don’t make enough time for themselves. We fill our days with homework, extracurriculars, part-time jobs and more. But, if you can, having a dedicated day when you can do whatever you want is very liberating and makes us more motivated, creative, and consistent students over time. </p>",
    "Blog Image": "https://uploads-ssl.webflow.com/61a33234ec52cc692c647c76/642b1e3a4cc340567a5f16e3_61a555bddf8058080e3882ef_Success%2520and%2520Failure%2520Image.jpeg",
    "Author Bio": "Jodie Hung",
    "Link for Author info": "https://www.thaddeus.org/staff"
}