{
    "Title": "Why Wait?: Combating Procrastination",
    "Slug": "why-wait-combating-procrastination",
    "Collection ID": "6414e6adc3b6490969cdbc53",
    "Item ID": "642b1eaff14eabb9acc79fc2",
    "Created On": "Mon Apr 03 2023 18:45:03 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Sun Jul 30 2023 22:05:55 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Sun Jul 30 2023 23:07:44 GMT+0000 (Coordinated Universal Time)",
    "Title Tag": "Why Wait?: Combating Procrastination",
    "Author(s)": "Carissa",
    "Date Published": "Wed Mar 30 2022 00:00:00 GMT+0000 (Coordinated Universal Time)",
    "Blog Intro": "Procrastination. A word I am sure we’ve all come across once or dozens of times in our lives. A word that strikes terror in the hearts of students all over the world. But what does it mean? The scientific definition says that procrastination is a “self-regulatory failure where people voluntarily but irrationally delay important tasks.”",
    "Blog Content": "<p id=\"\">Procrastination. &nbsp;</p><p id=\"\"> &nbsp;</p><p id=\"\">A word I am sure we’ve all come across once or dozens of times in our lives. &nbsp;</p><p id=\"\">A word that strikes terror in the hearts of students all over the world. &nbsp;</p><p id=\"\">But what does it mean? &nbsp;</p><p id=\"\"> &nbsp;</p><p id=\"\">The scientific definition says that procrastination is a “self-regulatory failure where people voluntarily but irrationally delay important tasks.” &nbsp;</p><p id=\"\"> &nbsp;</p><p id=\"\">This means that people will choose not to do something important even though they know that they should. This normally results in a LOT of extra stress and maybe some extra late nights. We already know how lack of sleep and extra stress can affect our mental health. Procrastinating often creates a perfect breeding ground for anxiety and depression and all of the physical manifestations that come with it. &nbsp;</p><p id=\"\">Studies have shown that procrastination is caused by personality, decision-making style, time organization and perspectives, situational factors, and emotional regulation. &nbsp; </p><p id=\"\"> &nbsp;</p><p id=\"\">That was all about what procrastination IS. One thing that I would like to remind you of is that it IS NOT a product of laziness. It can be easy to get frustrated with ourselves when we are not doing what we know we should be doing. Calling ourselves lazy or unmotivated does not help and the reality is, it’s just not true. &nbsp; </p><p id=\"\"> &nbsp;</p><p id=\"\">The great news is that there are ways to help you combat procrastination and make your life a little easier: &nbsp;</p><p id=\"\"> &nbsp;</p><ol id=\"\"><li id=\"\">Set small and attainable goals: &nbsp;</li></ol><p id=\"\">Looking at a large project or assignment can be overwhelming. When you get assigned the project, break it up into bite-sized pieces that make it easier to digest. &nbsp; </p><ol start=\"2\" id=\"\"><li id=\"\">Organize your tasks and write them down: &nbsp;</li></ol><p id=\"\">Once you have broken down the pieces, make a list of what parts are most important and put some dates on them. I have post-its all over my desk and room! &nbsp;Maybe make the incentive even better by adding some rewards when you complete the task on time. (my favorite is to bribe myself with junk food or order myself ice cream from postmates) &nbsp;</p><ol start=\"3\" id=\"\"><li id=\"\">Focus your attention in timed increments: &nbsp;</li></ol><p id=\"\">This is where it gets a little trickier. Focusing your attention on a task requires energy. Maybe give yourself a timed goal here. Work for 40 min and then take a 15-20 min break. DO this until the task is done. During the break, you can do something active, have a snack, dance party in the living room, etc. &nbsp;</p><ol start=\"4\" id=\"\"><li id=\"\">Remove as many distractions as possible: &nbsp;</li></ol><p id=\"\">While you’re focused on your work, turn off the TV or at least have your back to it. Turn your phone on silent or work mode if you are using it as a timer. If necessary, maybe even go and work outside. The home can be hectic at times and the fresh air could be a nice change. &nbsp; </p><ol start=\"5\" id=\"\"><li id=\"\">Be gentle with yourself and show some compassion: &nbsp;</li></ol><p id=\"\">If you still end up procrastinating after trying all of this, it’s alright! This is a process! Be kind to yourself and proud of your progress. Remember that you’re doing your best. &nbsp;</p><p id=\"\">‍</p><p id=\"\"><strong id=\"\">References:</strong> &nbsp;</p><p id=\"\"><a href=\"https://procrastination.com/what-is-procrastination\" target=\"_blank\" id=\"\">https://procrastination.com/what-is-procrastination</a> </p><p id=\"\"> <a href=\"https://www.psychologytoday.com/us/basics/procrastination\" target=\"_blank\" id=\"\">https://www.psychologytoday.com/us/basics/procrastination</a> </p><p id=\"\"><a href=\"https://www.nytimes.com/2019/03/25/smarter-living/why-you-procrastinate-it-has-nothing-to-do-with-self-control.html\" target=\"_blank\" id=\"\">https://www.nytimes.com/2019/03/25/smarter-living/why-you-procrastinate-it-has-nothing-to-do-with-self-control.html</a> </p><p id=\"\"><a href=\"https://www.mindtools.com/pages/article/newHTE_96.htm\" target=\"_blank\" id=\"\">https://www.mindtools.com/pages/article/newHTE_96.htm</a> </p><p id=\"\">‍</p><p id=\"\">‍</p>",
    "Blog Image": "https://uploads-ssl.webflow.com/61a33234ec52cc692c647c76/642b1eaef14eab0d99c79fc1_62448b3283c2486ab55e6e1e_GetImageAttachment.jpeg",
    "Author Bio": "Carissa is in her first year of the Baylor University Garland School of Social Work Masters program. She is currently interning at Thaddeus in the Resource Center and Homework Hotspot Committee. She enjoys exercising, meditating, eating, and true crime podcasts.",
    "Link for Author info": "https://www.thaddeus.org/staff"
}